wl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-02-11 Tue 14:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs - Wanderlust</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs - Wanderlust</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf77980b">Introduction</a></li>
<li><a href="#orge7e2a01">Installation</a></li>
<li><a href="#orga64d9a9">Configuration</a></li>
<li><a href="#org842cc89">Usage</a>
<ul>
<li><a href="#org84b8445">Startup</a></li>
<li><a href="#org6498440">Key bindings</a>
<ul>
<li><a href="#orgd6c43bf">Draft buffer</a></li>
<li><a href="#orgf0ac735">Summary buffer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf77980b" class="outline-2">
<h2 id="orgf77980b">Introduction</h2>
<div class="outline-text-2" id="text-orgf77980b">
<p>
Wanderlust is also a mail client within Emacs. This post aims to summarize the procedure of its installation and configurations.
</p>
</div>
</div>
<div id="outline-container-orge7e2a01" class="outline-2">
<h2 id="orge7e2a01">Installation</h2>
<div class="outline-text-2" id="text-orge7e2a01">
<p>
Wanderlust can be directly installed via ELPA. APEL, SEMI and FLIM are also installed as dependency.
</p>
</div>
</div>
<div id="outline-container-orga64d9a9" class="outline-2">
<h2 id="orga64d9a9">Configuration</h2>
<div class="outline-text-2" id="text-orga64d9a9">
<p>
We postulate that all the mails are stored in <code>~/.Mail</code>, in which there are a plurality of Maildir folders, e.g., <code>draft</code>, <code>queue</code>, <code>sent</code>, <code>trash</code>, <code>boc</code>, <code>edas</code>, <code>home</code>, <code>office</code>, <code>linkedin</code>, <code>r1</code>, <code>r1nr</code>, <code>rp</code>. Mails are periodically fetched by getmail or offlineimap, e.g.,
</p>
<div class="org-src-container">
<pre class="src src-sh">*/10 * * * * /usr/bin/getmail --new --getmaildir=/PATH/TO/GETMAILRC --rcfile=GETMAILRC
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-sh">*/10 * * * * /usr/bin/offlineimap -c /PATH/TO/OFFLINEIMAPRC -a ACCOUNT
</pre>
</div>

<p>
In this case, following configurations are needed for wanderlust.
</p>
<ul class="org-ul">
<li><p>
<code>~/.config/emacs/init.el</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">wl</span>
  <span style="color: #e090d7;">:ensure</span> wanderlust
  <span style="color: #e090d7;">:init</span>
  (<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">mime-w3m</span>)
  (autoload 'wl <span style="color: #e9b96e;">"wl"</span> <span style="color: #e9b96e;">"Wanderlust"</span> t)
  (autoload 'wl-other-frame <span style="color: #e9b96e;">"wl"</span> <span style="color: #e9b96e;">"Wanderlust on new frame."</span> t)
  (autoload 'wl-draft <span style="color: #e9b96e;">"wl-draft"</span> <span style="color: #e9b96e;">"Write draft with Wanderlust."</span> t)
  (autoload 'wl-user-agent-compose <span style="color: #e9b96e;">"wl-draft"</span> nil t)
  <span style="color: #e090d7;">:config</span>
  (<span style="color: #b4fa70;">if</span> (boundp 'mail-user-agent)
      (<span style="color: #b4fa70;">setq</span> mail-user-agent 'wl-user-agent))
  (<span style="color: #b4fa70;">if</span> (fboundp 'define-mail-user-agent)
      (define-mail-user-agent
        'wl-user-agent
        'wl-user-agent-compose
        'wl-draft-send
        'wl-draft-kill
        'mail-send-hook))
  <span style="color: #e090d7;">:custom</span>
  (wl-from <span style="color: #e9b96e;">"Shaka <a href="mailto:shaka%40company.com">&lt;shaka@company.com&gt;</a>"</span>)
  (org-mime-library 'semi)
  (wl-folder-check-async t)
  (wl-stay-folder-window t)
  (wl-fcc-force-as-read t)
  (wl-interactive-exit nil)
  (wl-insert-message-id nil)
  (wl-quicksearch-folder <span style="color: #e9b96e;">"[]"</span>)
  (elmo-search-default-engine 'notmuch)
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">Folders</span>
  (wl-folder-desktop-name <span style="color: #e9b96e;">"xi"</span>)
  (wl-folders-file <span style="color: #e9b96e;">"~/.config/emacs/xi/folders"</span>)
  (elmo-maildir-folder-path <span style="color: #e9b96e;">"~/.Mail"</span>)
  (elmo-localdir-folder-path <span style="color: #e9b96e;">"~/.Mail"</span>)
  (wl-temporary-file-directory <span style="color: #e9b96e;">"/tmp"</span>)
  (wl-default-spec <span style="color: #e9b96e;">"."</span>)
  (wl-trash-folder <span style="color: #e9b96e;">".trash"</span>)
  (wl-fcc <span style="color: #e9b96e;">".sent"</span>)
  (wl-draft-folder <span style="color: #e9b96e;">".draft"</span>)
  (wl-queue-folder <span style="color: #e9b96e;">".queue"</span>)
  (wl-summary-auto-refile-skip-marks nil)
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">Auto refile</span>
  (wl-refile-rule-alist
   '(((<span style="color: #e9b96e;">"To"</span> <span style="color: #e9b96e;">"Cc"</span>)
      (<span style="color: #e9b96e;">".*3gpp_tsg_ran@list\\.etsi\\.org.*"</span> . <span style="color: #e9b96e;">".~/.Mail/rp"</span>)
      (<span style="color: #e9b96e;">".*3gpp_tsg_ran_wg1@list\\.etsi\\.org.*"</span> . <span style="color: #e9b96e;">".~/.Mail/r1"</span>)
      (<span style="color: #e9b96e;">".*3gpp_tsg_ran_wg1_nr@list\\.etsi\\.org.*"</span> . <span style="color: #e9b96e;">".~/.Mail/r1nr"</span>))
     (<span style="color: #e9b96e;">"From"</span>
      (<span style="color: #e9b96e;">".*personalservice@bank-of-china\\.com.*"</span> . <span style="color: #e9b96e;">".~/.Mail/boc"</span>)
      (<span style="color: #e9b96e;">".*10000bj@189\\.cn.*"</span> . <span style="color: #e9b96e;">".~/.Mail/telecomm"</span>)
      (<span style="color: #e9b96e;">".+@linkedin\\.com.*"</span> . <span style="color: #e9b96e;">".~/.Mail/linkedin"</span>))
     (<span style="color: #e9b96e;">"Subject"</span> (<span style="color: #e9b96e;">".*EDAS-CFP.*"</span> . <span style="color: #e9b96e;">".~/.Mail/edas"</span>))
     (<span style="color: #e9b96e;">"To"</span>
      (<span style="color: #e9b96e;">".*shaka@home\\.com.*"</span> . <span style="color: #e9b96e;">".~/.Mail/home"</span>)
      (<span style="color: #e9b96e;">".*shaka@company\\.com.*"</span> . <span style="color: #e9b96e;">".~/.Mail/office"</span>))))
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">Send mail with msmtp.</span>
  (wl-draft-send-mail-function 'wl-draft-send-mail-with-sendmail)
  (message-sendmail-envelope-from 'header)
  (mail-envelope-from 'header)
  (mail-specify-envelope-from t)
  (sendmail-program <span style="color: #e9b96e;">"/usr/bin/msmtp"</span>)
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">Appearance</span>
  (mime-header-accept-quoted-encoded-words t)
  (wl-message-ignored-field-list '(<span style="color: #e9b96e;">"."</span>))
  (wl-message-visible-field-list '(<span style="color: #e9b96e;">"^Subject:"</span> <span style="color: #e9b96e;">"^Date:"</span> <span style="color: #e9b96e;">"^From:"</span> <span style="color: #e9b96e;">"^</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">(</span><span style="color: #e9b96e;">To</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">|</span><span style="color: #e9b96e;">Cc</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">)</span><span style="color: #e9b96e;">:"</span>))
  (wl-summary-width 100)
  (wl-biff-check-folder-list '(<span style="color: #e9b96e;">".~/.Mail/home"</span> <span style="color: #e9b96e;">".~/.Mail/office"</span>))
  (wl-summary-line-format <span style="color: #e9b96e;">"%5(%n%) %3(%T%P%) %15(%f%) %23(%Y-%M-%D(%W) %h:%m%) %t%C%s"</span>))
</pre>
</div></li>
<li><p>
<code>~/.config/emacs/xi/folders</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">.~/.Mail/home <span style="color: #e9b96e;">"home"</span>
home{
.~/.Mail/boc <span style="color: #e9b96e;">"boc"</span>
.~/.Mail/telecomm <span style="color: #e9b96e;">"telecomm"</span>
.~/.Mail/linkedin <span style="color: #e9b96e;">"linkedin"</span>
.~/.Mail/edas <span style="color: #e9b96e;">"edas"</span>
}

.~/.Mail/office <span style="color: #e9b96e;">"office"</span>
office{
.~/.Mail/rp <span style="color: #e9b96e;">"rp"</span>
.~/.Mail/r1 <span style="color: #e9b96e;">"r1"</span>
.~/.Mail/r1nr <span style="color: #e9b96e;">"r1nr"</span>
}

.~/.Mail/sent <span style="color: #e9b96e;">"sent"</span>
.~/.Mail/draft <span style="color: #e9b96e;">"draft"</span>
.~/.Mail/trash <span style="color: #e9b96e;">"trash"</span>

# %INBOX:shaka/clear@imap.home.com:143 <span style="color: #e9b96e;">"home"</span>
# %INBOX:shaka/clear@imap.company.com:993! <span style="color: #e9b96e;">"office"</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org842cc89" class="outline-2">
<h2 id="org842cc89">Usage</h2>
<div class="outline-text-2" id="text-org842cc89">
</div>
<div id="outline-container-org84b8445" class="outline-3">
<h3 id="org84b8445">Startup</h3>
<div class="outline-text-3" id="text-org84b8445">
<p>
In an emacs, wanderlust can be started by <code>M-x wl</code>.
</p>
</div>
</div>
<div id="outline-container-org6498440" class="outline-3">
<h3 id="org6498440">Key bindings</h3>
<div class="outline-text-3" id="text-org6498440">
</div>
<div id="outline-container-orgd6c43bf" class="outline-4">
<h4 id="orgd6c43bf">Draft buffer</h4>
<div class="outline-text-4" id="text-orgd6c43bf">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function and description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c TAB</code></td>
<td class="org-left">Insert a file at the end of the buffer, with separator lines around it, <code>mail-insert-file</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-x TAB</code></td>
<td class="org-left">Enclose a file as attachment, <code>mime-edit-insert-file</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-k</code></td>
<td class="org-left">Kill a draft, <code>wl-draft-kill</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-c</code></td>
<td class="org-left">Send and exit, <code>wl-draft-send-and-exit</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-w</code></td>
<td class="org-left"><code>mail-signature</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-t</code></td>
<td class="org-left"><code>mail-text</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f</code></td>
<td class="org-left">Edit fields in mail header, e.g., cc, bcc.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf0ac735" class="outline-4">
<h4 id="orgf0ac735">Summary buffer</h4>
<div class="outline-text-4" id="text-orgf0ac735">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Function and description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><code>wl-summary-toggle-disp-folder</code></td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left"><code>wl-summary-toggle-disp-msg</code></td>
</tr>

<tr>
<td class="org-left"><code>n/p</code></td>
<td class="org-left"><code>wl-summary-next/wl-summary-prev</code></td>
</tr>

<tr>
<td class="org-left"><code>N/P</code></td>
<td class="org-left">Move to next/previous unread mail, <code>wl-summary-down/wl-summary-up</code></td>
</tr>

<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">Mark, <code>wl-summary-target-mark</code></td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left"><code>wl-summary-unmark</code></td>
</tr>

<tr>
<td class="org-left"><code>U</code></td>
<td class="org-left"><code>wl-summary-unmark-all</code></td>
</tr>

<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left"><code>wl-summary-exit</code></td>
</tr>

<tr>
<td class="org-left"><code>SPC</code></td>
<td class="org-left"><code>wl-summary-read</code></td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left"><code>wl-summary-sync</code></td>
</tr>

<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">Toggle a thread, <code>wl-summary-open-close</code></td>
</tr>

<tr>
<td class="org-left"><code>[</code></td>
<td class="org-left"><code>wl-thread-open-all</code></td>
</tr>

<tr>
<td class="org-left"><code>]</code></td>
<td class="org-left"><code>wl-thread-close-all</code></td>
</tr>

<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left"><code>wl-summary-reply</code></td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left"><code>wl-summary-forward</code></td>
</tr>

<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left"><code>wl-summary-write</code></td>
</tr>

<tr>
<td class="org-left"><code>z</code></td>
<td class="org-left"><code>wl-summary-suspend</code></td>
</tr>

<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left"><code>wl-summary-mark-as-unread</code></td>
</tr>

<tr>
<td class="org-left"><code>R</code></td>
<td class="org-left"><code>wl-summary-mark-as-read</code></td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left"><code>wl-summary-dispose</code></td>
</tr>

<tr>
<td class="org-left"><code>C-o</code></td>
<td class="org-left"><code>wl-summary-auto-refile</code></td>
</tr>

<tr>
<td class="org-left"><code>$</code></td>
<td class="org-left"><code>wl-summary-mark-as-important</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
